tradestuff/app/controllers/home_controller.rb

SELECT "items".* FROM "items"
---
  def show
    @items = Item.all

SELECT "userinfos".* FROM "userinfos"
---
  def users_account
   @userinfos = Userinfo.all